app/views/modelos/_form.html.erb

SELECT "series".* FROM "series"
---
    <%= f.label :serie_id %><br />
    <%= f.collection_select :serie_id, Serie.all, :id, :nombre %>