app/controllers/accesorios_controller.rb

  def index
    @accesorios = Accesorio.all
---
SELECT "accesorios".* FROM "accesorios"

  def show
    @accesorio = Accesorio.find(params[:id])
---
SELECT "accesorios".* FROM "accesorios" WHERE "accesorios"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @accesorio = Accesorio.find(params[:id])
---
SELECT "accesorios".* FROM "accesorios" WHERE "accesorios"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @accesorio = Accesorio.new(params[:accesorio])

    respond_to do |format|
      if @accesorio.save
---
INSERT INTO "accesorios" ("created_at", "descripcion", "modelo_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Jun 2013 23:23:29 UTC +00:00], ["descripcion", "asdasdasd"], ["modelo_id", 1], ["updated_at", Fri, 21 Jun 2013 23:23:29 UTC +00:00]]