app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT "clientes".* FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("apellido", "created_at", "nombre", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?)  [["apellido", "bernal"], ["created_at", Fri, 14 Jun 2013 23:01:10 UTC +00:00], ["nombre", "daniel"], ["updated_at", Fri, 14 Jun 2013 23:01:10 UTC +00:00], ["usuario_id", 1]]