app/controllers/componentes_controller.rb

SELECT "componentes".* FROM "componentes"
---
  def index
    @componentes = Componente.all

SELECT "componentes".* FROM "componentes" WHERE "componentes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @componente = Componente.find(params[:id])

INSERT INTO "componentes" ("created_at", "descripcion", "proveedor_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Jun 2013 23:24:07 UTC +00:00], ["descripcion", "microfono"], ["proveedor_id", 1], ["updated_at", Fri, 21 Jun 2013 23:24:07 UTC +00:00]]
---
  def create
    @componente = Componente.new(params[:componente])

    respond_to do |format|
      if @componente.save