app/controllers/modelos_controller.rb

SELECT "modelos".* FROM "modelos"
---
  def index
    @modelos = Modelo.all

SELECT "modelos".* FROM "modelos" WHERE "modelos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @modelo = Modelo.find(params[:id])

SELECT "modelos".* FROM "modelos" WHERE "modelos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @modelo = Modelo.find(params[:id])

INSERT INTO "modelos" ("codigo", "created_at", "fecha_lanzamiento", "nombre", "serie_id", "sistema_operativo_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @modelo = Modelo.new(params[:modelo])

    respond_to do |format|
      if @modelo.save

SELECT "modelos".* FROM "modelos" WHERE "modelos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "modelos" SET "sistema_operativo_id" = 1, "updated_at" = '2013-06-21 23:29:18.983145' WHERE "modelos"."id" = 1
---
  def update
    @modelo = Modelo.find(params[:id])

    respond_to do |format|
      if @modelo.update_attributes(params[:modelo])

SELECT "modelos".* FROM "modelos"
---
  def buscar
    @modelo = Modelo.new
    @modelos = Modelo.all

SELECT "modelos".* FROM "modelos" WHERE (nombre LIKE '%pepe%')
---
  def resultados
    @modelo = Modelo.new
    @modelos = Modelo.where("nombre LIKE ?", "%" + params[:buscar][:nombre] + "%" )