app/controllers/personas_controller.rb

SELECT "personas".* FROM "personas"
---
  def index
    @personas = Persona.all