app/controllers/series_controller.rb

SELECT "series".* FROM "series"
---
  def index
    @series = Serie.all

SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "create"]]
---
  def show
    @serie = Serie.find(params[:id])

SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @serie = Serie.find(params[:id])

INSERT INTO "series" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 14 Jun 2013 23:22:00 UTC +00:00], ["nombre", "98765432"], ["updated_at", Fri, 14 Jun 2013 23:22:00 UTC +00:00]]
---
  def create
    @serie = Serie.new(params[:serie])

    respond_to do |format|
      if @serie.save

SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "series" SET "nombre" = '74563217', "updated_at" = '2013-06-14 23:33:14.580407' WHERE "series"."id" = 2
---
  def update
    @serie = Serie.find(params[:id])

    respond_to do |format|
      if @serie.update_attributes(params[:serie])