app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "login", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 14 Jun 2013 23:01:29 UTC +00:00], ["login", "babe"], ["password", "123456"], ["updated_at", Fri, 14 Jun 2013 23:01:29 UTC +00:00]]