app/views/accesorios/_form.html.erb

SELECT "modelos".* FROM "modelos"
---
    <%= f.label :modelo_id %><br />
    <%= f.collection_select :modelo_id, Modelo.all, :id, :nombre %>